{
  "Top": {
    "name": "Yimi",
    "intro": "Hi👋~ I'm Yimi, a Full Stack Developer."
  },
  "About": {
    "text": "About Me",
    "data": {
      "info": [
        "<em>Capable of the entire project development</em>, including project requirements, interface design, front end, back end, release, etc.",
        "Master multiple development technologies, including java backend, web front end, mobile cross-platform, desktop application, database, nginx, distributed cluster, etc.",
        "Lead the team through the project development."
      ]
    }
  },
  "Education": {
    "text": "Education",
    "data": {
      "name": "Hunan University of Arts and Sciences",
      "major": "Computer Science and Technology ",
      "date": "2021"
    }
  },
  "Skills": {
    "text": "Technology Stack",
    "data": [
      {
        "type": "Back End",
        "list": [
          "Java",
          "SpringCloud",
          "Netty",
          "ExpressJs",
          "NodeJs",
          "Mysql/MariaDB",
          "Redis",
          "MongoDB"
        ]
      },
      {
        "type": "Front End",
        "list": ["Vue", "Svelte", "uni-app", "Nuxt", "Html/CSS", "Electron"]
      },
      {
        "type": "Other",
        "list": ["Docker", "MP2", "Nginx", "Jenkins", "Wordpress"]
      },
      {
        "type": "Design",
        "list": ["Axure", "Photoshop"]
      }
    ]
  },
  "Projects": {
    "text": "Projects",
    "data": [
      {
        "name": "Hunan Institute of Water Resources and Hydropower Research Personnel Records Management System",
        "date": "2022.06 - 2022.07",
        "desc": "Personnel file management system of the Academy of Water Sciences is a computer system that adopts the technologies of electronic archives, image digitization, paperless office and information networking to realize the storage and query and retrieval of multimedia archive resources including archive documents, sound, image and text, providing an effective technical guarantee for the management, utilization and protection of archive materials, infinitely prolonging the preservation time of the archive materials, and bringing convenience to the access and utilization of the archive documents. Archival literature to bring convenience.",
        "skills": ["SpringCloud", "Vue", "Minio", "MySql"],
        "duty": [
          "Writing related documents, prototyping, UI design",
          "Responsible for website front and backend framework construction, component packaging, progress management",
          "Selection of high-fidelity camera manufacturers, equipment docking debugging"
        ],
        "url": ""
      },
      {
        "name": "Information Platform of Liling Center for Disease Control and Prevention",
        "date": "2021.12 - 2022.04",
        "desc": "A general control platform integrating smart office, smart property management, smart LIS system, performance appraisal, health education management, smart party building, chronic disease management and infectious disease information management.",
        "skills": ["SpringCloud", "Vue", "Redis", "MySql"],
        "duty": [
          "prototype design, UI design",
          "responsible for building the front and back frames of the website",
          "System Management, Intelligent Party Building and Development"
        ],
        "url": "http://218.76.171.78:12012/"
      },
      {
        "name": "Comprehensive Management Platform of Network Information Office",
        "date": "2019.05 - 2019.12",
        "desc": "Based on the network environment, we independently develop network public opinion briefing, network collaborative office, etc., integrate various data resources such as security early warning and situation awareness, and realize the integrated network information collection, dynamic supervision, analysis, statistics, early warning, disposal and other functions through multi-department information sharing and collaborative work.",
        "skills": ["SpringCloud", "Vue", "Redis", "MySql"],
        "duty": [
          "database design",
          "prototype design, UI design",
          "Be responsible for building the front and back frame of the website"
        ],
        "url": ""
      },
      {
        "name": "Changsha Internet Information Office Public Opinion Briefing System",
        "date": "2019.04 - 2019.05",
        "desc": "Briefing system, including briefing management, briefing label management, briefing material management, review and approval, finalization management, export and other modules, to provide convenience for the Office of the Internet Information Office office staff",
        "skills": ["Spring", "layui", "MySql"],
        "duty": [
          "Write relevant documentation documentation, database design, prototyping, UI design",
          "framework building, component development, delivery"
        ],
        "url": ""
      },
      {
        "name": "Online Learning and Training Platform For Road Transportation",
        "date": "2019.02 - 2019.03",
        "desc": "For drivers who hold the Road Transportation Qualification Certificate and are engaged in the transportation of passengers, ordinary goods and dangerous goods, online registration, training and graduation are conducted through PC and mobile terminals, and training, learning, assessment and scoring are conducted through video exercises.",
        "skills": ["SpringBoot", "MySql", "Vue", "uniapp"],
        "duty": [
          "Responsible for the construction of the front-end framework of the website, the development of the question and answer component and the development of the video playback score component.",
          "The entire project UI design including PC, WeChat and code implementation",
          "WeChat Alipay front-end and back-end implementation",
          "Face Recognition Back-End Docking and Front-End Presentation",
          "Subsequent optimization improvements"
        ],
        "url": "https://jtwx.cn"
      },
      {
        "name": "Multi-dimensional Application Security Threat Awareness and Defense System",
        "date": "2018.10 - 2018.11",
        "desc": "Nesun Multi-dimensional Application Security Threat Awareness and Defense System is an application security firewall system developed by Shenzhen Nexsion Technology Co., Ltd. based on the technical research in the field of application security, combined with the current status quo and demand for application security.",
        "skills": ["layui", "springboot", "MySql"],
        "duty": [
          "Single-handedly perform the entire project management side including front and back end",
          "Configuration file front-end visualization plugin development"
        ],
        "url": "https://www.nesun.cn/products?id=MultidimensionalApplicationFirewallSystemCopy&name=%E5%AE%89%E5%85%A8%E9%98%B2%E6%8A%A4"
      },
      {
        "name": "TaoLaw (Ali Law)",
        "date": "2018.06 - 2018.08",
        "desc": "online legal platform, which provides a platform for lawyers, teams and consultants to communicate and handle, as well as legal information. Lawyers can obtain the source of cases published by consultants through the platform, and they can publish personal information trends and articles. Consultants can choose lawyers to go to court through the platform, and they can view legal information and laws and regulations. ",
        "skills": ["NuxtJs", "Vue", "Vuex", "ElementUI", "MySql"],
        "duty": [
          "Complete the front-end development alone",
          "Third-party login and docking of WeChat, QQ and Sina",
          "WeChat Alipay Payment"
        ],
        "url": "https://www.taofa.cn"
      },
      {
        "name": "Crowd Supervision System",
        "date": "2018.03 - 2018.05",
        "desc": "a system for managing special people. The system can realize the high-precision real-time positioning and management of key personnel by the staff of relevant departments through PC and mobile devices by wearing bracelet equipment. GPS/ Beidou positioning is adopted to realize real-time position data, and managers with different authorities can view the real-time position, abnormal situation, aggregation warning, hurdle alarm, personal situation and other data of all monitored objects in their corresponding authority areas. ",
        "skills": ["SpringBoot", "Netty", "jQuery", "EChart", "Redis", "MySql", "NB-IoT"],
        "duty": [
          "Front-end and back-end framework construction, database design, server-side interface based on rest, PC and Android to provide data interface",
          "Back-end aggregation and fence crossing algorithm implementation, front-end positioning map display implementation, fence editing component implementation, action track display",
          "communications monitoring capability",
          "Device Docking, Huawei NB-IOT Docking",
          "UI design, large screen homepage design and code implementation",
          "Optimization improvements"
        ],
        "url": ""
      },
      {
        "name": "Uncle Cat's Car Circle App",
        "date": "2017.06 - 2017.08",
        "desc": "Uncle Cat's car enthusiasts circle forum, to car meet friends, provide online chat, share life, share the road, provide services around the neighborhood, the nearby gas station services, you can buy small goods around, as well as points redemption, small games pk and other dating app",
        "skills": ["uni-app", "PhaserJs", "RequireJs", "MyBatis", "MySql", "Spring"],
        "duty": [
          "According to the ui front-end code implementation",
          "Nearby gas stations, buddy chat",
          "Mini-game development"
        ],
        "url": ""
      },
      {
        "name": "Ju jing jia pin cross-border e-commerce platform",
        "date": "2016.05 - 2017.01",
        "desc": "Jujingjiapin cross-border e-commerce platform is a B2B and B2C e-commerce platform that cooperates with Mango TV, mainly with TV stations and shops. The platform is divided into three systems: backstage general system, store system and front-end WeChat WeChat official account.",
        "skills": ["SpringMVC", "Freemarker", "MyBatis", "MySql", "MemberCache", "JQuery"],
        "duty": [
          "Analyze requirements, create interface prototypes, UI design",
          "Responsible for building the front-end framework of the website, functional componentization",
          "Responsible for WeChat public number development, backend development",
          "Help colleagues to solve problems encountered in the project",
          "Optimize and improve the subsequent interface operation of the product"
        ],
        "url": ""
      },

      {
        "name": "Hunan National Tax Office",
        "date": "2016.02 - 2016.03",
        "desc": "Response internet+, and Hunan State Taxation Bureau, local companies and enterprises in Hunan can pay taxes through WeChat or app mobile phones, avoiding the trouble of going to the tax bureau, and providing convenient services such as tax-related matters inquiry, payment declaration, payment calendar and tax navigation.",
        "skills": ["Phonegap", "SeaJs", "FrozenUI", "ZeptoJs", "BaiduMap"],
        "duty": [
          "Framework: the choice of phonegap to achieve a development across the three ends , the use of seajs modular development , the choice of lightweight plug-ins frozenUI + zeptojs",
          "Realization of functions such as tax reservation, tax edition navigation, simple declaration, UnionPay online tax payment, three-party agreement tax payment, invoice inspection, invoice application, tax payment vouchers, complaint and report, as well as querying personal tax information and tax consulting.",
          "Write design documents",
          "Help colleagues to solve problems encountered in the project",
          "Go-live testing and maintenance"
        ],
        "url": ""
      },
      {
        "name": "Electronic Taxation Bureau of Hunan Province, State Administration of Taxation",
        "date": "2015.11 - 2016.01",
        "desc": "Responding to Internet+, Hunan State Tax Palm Tax Office, realizes to let local companies and enterprises in Hunan pay taxes and fees through WeChat or app cell phone, eliminating the trouble of going to the tax office, and provides convenient services such as inquiries on tax-related matters, declaration and payment, payment calendar, tax navigation and so on.",
        "skills": ["bootstrap", "jQuery", "Springboot", "oracle"],
        "duty": [
          "Framework: the choice of phonegap to achieve a development across the three ends , the use of seajs modular development , the choice of lightweight plug-ins frozenUI + zeptojs",
          "Realization of functions such as tax reservation, tax edition navigation, simple declaration, UnionPay online tax payment, three-party agreement tax payment, invoice inspection, invoice application, tax payment vouchers, complaint and report, as well as querying personal tax information and tax consulting.",
          "Help colleagues to solve problems encountered in the project",
          "Go-live testing and maintenance"
        ],
        "url": "https://etax.hunan.chinatax.gov.cn/wsbs/"
      },
      {
        "name": "Tax financial Connect",
        "date": "2015.08 - 2015.10",
        "desc": "Tax financial Connect is a platform to solve the difficulty of financing and lending for small and medium-sized enterprises by integrating tax, bank, insurance and other market resources through the Internet platform with the help of “Internet+” mode.",
        "skills": ["BootStrap", "JQuery", "Spring3", "Struts2", "ibatis", "Oracle"],
        "duty": [
          "Design foreground and background pages, make UI design of interface prototype",
          "Front and Back Frame Building",
          "The functions of issuing loans at the front desk, registering and logging in, national tax authorization, message management and account management are realized",
          "Implementation of related functions such as background organization management, user management, registered user management and query statistics",
          "Help colleagues solve problems encountered in the project",
          "Post-related function maintenance"
        ],
        "url": ""
      },
      {
        "name": "Abc Tax Net",
        "date": "2015.04 - 2015.06",
        "desc": "",
        "skills": ["BootStrap", "JQuery", "Spring3", "Struts2", "ibatis", "Oracle"],
        "duty": [
          "Personal center page with front and backend code writing",
          "Packaging rest plugins",
          "Pluginization of avatar uploads",
          "Optimization and Maintenance"
        ],
        "url": ""
      },
      {
        "name": "636 Enterprise Title Invoice System",
        "date": "2014.10 - 2015.01",
        "desc": "In accordance with the overall requirements of “simplifying the types of invoices, unifying the invoices, establishing a platform, and issuing on the network”, the enterprise title invoice system is constructed, which consists of three parts: enterprise invoicing client, invoice backend service terminal, and enterprise invoice management terminal, and realizes the functions of invoice purchase management, invoice distribution management, invoice item management, invoice balance management, invoice issuing on the network, and invoice checking and old payment and cancellation. It realizes the functions of invoice purchase management, invoice distribution management, invoice item management, invoice balance management, invoice network issuance, invoice checking, old payment and cancellation, establishes the long-term closed-loop management mechanism of invoices, and intensifies the supervision on the use of invoices of the enterprises, so as to avoid the tax-related risks brought by illegal violations.",
        "skills": ["Spring", "Struts2", "iBatis", "JQueryEasyUI"],
        "duty": [
          "Invoice entry, invoice printing, invoice preview, front and back end implementation",
          "Complex Invoice Item Entry Plugin Implementation",
          "Dropdown selector componentization",
          "paging componentization",
          "Page design",
          "Maintenance of back-end related functions"
        ],
        "url": ""
      },
      {
        "name": "Hunan State Tax Horizontal Networking V",
        "date": "2014.2 - 2014.04",
        "desc": "The operation and maintenance management system of Hunan State Tax Horizontal Networking Phase V provides the operation and maintenance personnel with the monitoring of the interaction information processing between horizontal networking and TIPS, which includes the monitoring of active interaction messages with TIPS, the monitoring of passive acceptance of TIPS notification messages, the querying and processing of abnormal data, the control of starting and stopping of the tax payment mode of the horizontal networking, and the checking of the tax payment situation of the background of the horizontal networking, etc., so as to provide the operation and maintenance personnel with more complete monitoring and operation and maintenance services. The functions of monitoring and maintenance include",
        "skills": ["Spring", "Struts2", "iBatis", "JQueryEasyUI"],
        "duty": [
          "Manual reconciliation module, manual warehousing module",
          "Clearing house line number maintenance module",
          "Horizontal networking back-office inspection module",
          "CUP FTP Detail File and Horizontal Networking Log Cleanup Function",
          "Operation parameter notification, status change notification"
        ],
        "url": ""
      },
      {
        "name": "Tax-Value-Management System (TVMS)",
        "date": "2013.8 - 2014.02",
        "desc": "Tax Silver Pass, tax-controlled cash register remote tax reporting and payment system, is divided into the front system and business system. 1, the front system is mainly responsible for interacting with the terminal access server, receiving and forwarding the terminal data to the business system and issuing commands to the terminal; 2, the business system is mainly responsible for receiving the data from the front system, relying on the general staff system, horizontal networking and other systems, the user's tax copy, reporting and payment of taxes. The business system is mainly responsible for receiving the data from the predecessor system and relying on the general reference system and horizontal networking system to process the tax copy and declaration, declaration and tax payment of users.",
        "skills": ["java Swing", "Socket", "Oracle stored procedure"],
        "duty": ["safeguard"],
        "url": ""
      }
    ]
  },
  "WorkExperience": {
    "text": "Work experience ",
    "data": [
      {
        "corporation": "Hunan Wongxin Hi-tech Technology Co., LTD. ",
        "date": "2021.05 ~",
        "job": "R&D Supervisor ",
        "info": "Number of subordinates: 8",
        "duty": [
          "Customize the company's R&D norms and management norms, build the company's R&D environment, build the company's basic framework, and remodel the official website.",
          "Resolve legacy undelivered project issues from previous principals and complete go-live delivery",
          "Requirements analysis, project plan development, documentation, project development control, completion of delivery"
        ]
      },
      {
        "corporation": "Hunan Tianren Information Technology Co., LTD.",
        "date": "2019.05 - 2021.04",
        "job": "R&D Supervisor ",
        "info": "Number of subordinates: 8",
        "duty": [
          "Creation of R&D team, customization of company R&D norms and management norms",
          "Complete the entire integrated governance platform prototyping, page design, page implementation, database development, and architecture alone.",
          "Formulate development plan and lead the team to complete the project development",
          "Project demonstration at the Office of Internet Information"
        ]
      },
      {
        "corporation": "Shenzhen Nensun Technology Co., LTD. ",
        "date": "2017.02 - 2019.05",
        "job": "Full Stack Developer",
        "info": "Number of subordinates: 8",
        "duty": [
          "Backend development, web development, mobile development",
          "Responsible for aggregation algorithms, crossbar algorithms and front-end visualization",
          "Responsible for project prototyping and UI design",
          "Baseline framework construction",
          "Maintenance of related projects"
        ]
      },
      {
        "corporation": "Hunan Xunlong Network Technology Co., LTD. ",
        "date": "2016.05 - 2017.01",
        "job": "Project Manager",
        "info": "Number of subordinates: 4",
        "duty": [
          "Participate in part of the back-end development, solely responsible for WeChat public number development, front-end development",
          "Responsible for prototype design, UI design, website front-end framework construction",
          "In response to user feedback, optimize and upgrade the product、maintenance"
        ]
      },
      {
        "corporation": "Hunan ABck Computer System Co., LTD. ",
        "date": "2013.02 - 2016.04 ",
        "job": "Project Manager",
        "info": "Number of subordinates: 4",
        "duty": [
          "Led the team to complete the development of wechat terminal and Android terminal of Hunan National Tax Pocket Tax Office;",
          "Project pre-study;",
          "Assign tasks;",
          "Prototyping, UI design;",
          "Frame building;"
        ]
      }
    ]
  },
  "Timeline": {
    "text": "Years as the song",
    "data": [
      {
        "date": "2013.02",
        "name": "Java JavaScript Html CSS MySql",
        "desc": "Self-learning software development"
      },
      {
        "date": "2013.06",
        "name": "Servlet",
        "desc": "Company internship assessment project"
      },
      {
        "date": "2013.08",
        "name": "Swing, Socket, Oracle stored procedure",
        "desc": "Maintenance projects"
      },
      {
        "date": "2014.02",
        "name": "Spring Struts2 iBatis Jquery JQueryEasyUI",
        "desc": "First project to be fully involved"
      },
      {
        "date": "2015.04",
        "name": "SpringMVC MyBatis JSP Maven",
        "desc": "Company's back-end technology upgrade"
      },
      {
        "date": "2015.08",
        "name": "Photoshop Axure Bootstrap CSShank",
        "desc": "The first time to complete the entire UI design and code implementation alone"
      },
      {
        "date": "2015.10",
        "name": "Seajs template.js Nginx Nodejs Gruntfile.js npm",
        "desc": "Lead the company's front end modularization, lead the company's front and back end separation"
      },
      {
        "date": "2015.11",
        "name": "PhoneGap ZeptoJs",
        "desc": "First project to solve cross-platform APP development"
      },
      {
        "date": "2016.05",
        "name": "SpringBoot Shiro",
        "desc": "Update company project technology"
      },
      {
        "date": "2017.06",
        "name": "PhaseJs uni-app",
        "desc": "First mini game developed"
      },
      {
        "date": "2018.02",
        "name": "Requirejs gulpJs jwt restful pnpm nvm",
        "desc": "Lead the company's project team to update the front-end technology"
      },
      {
        "date": "2018.03",
        "name": "Netty Redis",
        "desc": "Set up the framework development project"
      },
      {
        "date": "2018.05",
        "name": "Vue Vuex axios ElementUI",
        "desc": "Lead the company's project team to update the front-end technology"
      },
      {
        "date": "2018.06",
        "name": "NuxtJs",
        "desc": "First use of development project"
      },
      {
        "date": "2019.05",
        "name": "SpringCloud",
        "desc": "Company development technology"
      },
      {
        "date": "2021.02",
        "name": "Docker",
        "desc": ""
      },
      {
        "date": "2021.12",
        "name": "TailwindCSS",
        "desc": ""
      },
      {
        "date": "2022.04",
        "name": "Svelte SvelteKit Unocss",
        "desc": ""
      }
    ]
  }
}
